@extends('front.base')
@section('seo')
 <title>kiusk</title>
 <meta name="description"
       content="Here is a precise description of my awesome webpage.">
@endsection
@section('content')
 <section class=" blog-block m-0">
  <div class="container">
   <p class="p-3 ps-5">بازدیدها: 719</p>
   <div>
    <p><strong>در نظر داشته باشید، به منظور تسهیل و تسریع فرآیند انتشار آگهی‌ها، کیوسک ممکن است در
      مواردی بر اساس قوانین، متن یا عنوان آگهی شما را به طور جزئی تغییر دهد. همچنین کیوسک مجاز است
      هرگونه پیام، آگهی و یا عکسی که به این سایت ارسال می‌کنید یا هر حساب کاربری و اطلاعات دیگری
      که مربوط به شما یا ایجاد شده توسط شما باشد را هر زمان و به هر شکلی که ضروری بداند حذف نماید.
     </strong></p>
    <p><strong>
      در صورتی که گزارش تخلف کاربران نسبت به آگهی بیشتر از 5 مورد باشد، کیوسک به صلاحدید خود ممکن
      است اقدام به حذف آگهی نماید. در دو فرض اخیر کیوسک هیچ‌گونه مسئولیتی در قبال بازپرداخت
      هزینه‌های پرداختی بابت آگهی حذف شده به کاربر ندارد.
     </strong></p>
    <p><strong>
      آگهی‌دهندگان با ثبت آگهی خود در کیوسک تأیید می‌کنند که آگهی ایشان شامل مواردی که در ادامه
      آورده می‌شوند نخواهد بود و همچنین دارای سن بالای ۱۸ سال هستند.
     </strong></p>
    <div>
     <ul>
      <li>ناقض حریم شخصی افراد،</li>
      <li>آگهی‌های فروشی بدون تصویر در بخش‌های «مربوط به خانه» و «شخصی»،</li>
      <li>درج قیمت در عنوان آگهی،</li>
      <li>هر گونه توهین به ادیان</li>
      <li>استفاده ابزاری از تصاویر اشخاص در آگهی، درج بی‌مورد عکس صورت اشخاص یا استفاده از عکس
       کودکان برای معرفی کالا و خدماتی که مخاطب آن کودکان نیستند،
      </li>
      <li>ابزار یا آموزش‌های نفوذ، خرابکاری، شکستن قفل، هک و کرک،</li>
      <li>فروش برنامه‌های نرم‌افزاری یا کتاب‌هایی که شامل «قانون کپی رایت » می شوند،</li>
      <li>هر گونه کالایی که موجب رواج خشونت و آسیب رساندن به دیگران می‌شود، مانند: سلاح‌های گرم و
       سرد، مواد محترقه و امثال آن،
      </li>
      <li>درج مکرر آگهی‌‌های یکسان حتی با عناوین متفاوت در یک روز،</li>
      <li>ارسال مجدد یک آگهی‌‌ که از زمان حذف آن توسط کاربر، بیش از ۲۴ ساعت سپری نشده باشد،</li>
     </ul>
    </div>
   </div>
  </div>
 </section>


@endsection